gcc -g p1original.c
îº§ gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x7b1: file p1original.c, line 16.
(gdb) r
Starting program: /home/runner/pps-IA1-practice/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p1original.c:16
16  {
(gdb) n
18    input(&a,&b);
(gdb) s
input (a=0x7ffed37a2abc, b=0x7ffed37a2ac0) at p1original.c:4
4     printf("enter two numbers:n/");
(gdb) 7
Undefined command: "7".  Try "help".
(gdb) 8
Undefined command: "8".  Try "help".
(gdb) n
5     scanf("%d%d",a,b);
(gdb) n
enter two numbers:n/8
7
6   }
(gdb) n
main () at p1original.c:19
19    add(a,b,&sum);
(gdb) n
20    output(a,b,sum);
(gdb) n
21    return 0;
(gdb) n
22  }(gdb) c
Continuing.
sum of a,b is 8+7=15[Inferior 1 (process 263) exited normally]
(gdb) 